parties = [
    {
        "СтатусЗакрытия": False,
        "ПредставлениеЗаданияНаСмену": "Задание на смену 2345",
        "Линия": "Т2",
        "Смена": "1",
        "Бригада": "Бригада №4",
        "НомерПартии": 22222,
        "ДатаПартии": "2024-01-30",
        "Номенклатура": "Какая то номенклатура",
        "КодЕКН": "456678",
        "ИдентификаторРЦ": "A",
        "ДатаВремяНачалаСмены": "2024-01-30T20:00:00+05:00",
        "ДатаВремяОкончанияСмены": "2024-01-31T08:00:00+05:00"
    },
    {
        "СтатусЗакрытия": False,
        "ПредставлениеЗаданияНаСмену": "Задание на смену 2344",
        "Линия": "Т3",
        "Смена": "1",
        "Бригада": "Бригада №4",
        "НомерПартии": 44444,
        "ДатаПартии": "2024-01-29",
        "Номенклатура": "Какая то номенклатура",
        "КодЕКН": "456678",
        "ИдентификаторРЦ": "A",
        "ДатаВремяНачалаСмены": "2024-01-30T20:00:00+05:00",
        "ДатаВремяОкончанияСмены": "2024-01-31T08:00:00+05:00"
    },
    {
        "СтатусЗакрытия": True,
        "ПредставлениеЗаданияНаСмену": "Задание на смену 2344",
        "Линия": "Т3",
        "Смена": "1",
        "Бригада": "Бригада №4",
        "НомерПартии": 55555,
        "ДатаПартии": "2024-01-28",
        "Номенклатура": "Какая то номенклатура",
        "КодЕКН": "456678",
        "ИдентификаторРЦ": "A",
        "ДатаВремяНачалаСмены": "2024-01-30T20:00:00+05:00",
        "ДатаВремяОкончанияСмены": "2024-01-31T08:00:00+05:00"
    }
]

parties_answer = {
    "id": 1,
    "status_closed": False,
    "closed_at": None,
    "task_description": "Задание на смену 2345",
    "line": "Т2",
    "shift": "1",
    "brigade": "Бригада №4",
    "party_number": 22222,
    "party_date": "2024-01-30",
    "nomenclature": "Какая то номенклатура",
    "ecn_code": "456678",
    "rc_identifier": "A",
    "shift_start_datetime": "2024-01-30T15:00:00Z",
    "shift_end_datetime": "2024-01-31T03:00:00Z",
    "products": []
}

updated_parties = {
    "status_closed": False,
    "task_description": "Задание на смену 2345",
    "line": "Т2",
    "shift": "string",
    "brigade": "Бригада №55",
    "party_number": 22222,
    "party_date": "2024-01-30",
    "nomenclature": "A88",
    "ecn_code": "456677",
    "rc_identifier": "D1",
    "shift_start_datetime": "2024-01-30T15:00:00Z",
    "shift_end_datetime": "2024-01-31T03:00:00Z",
}

updated_parties_filter = updated_parties | {'closed_at': None,
                                            'id': 1,
                                            "shift_start_datetime": "2024-01-30T15:00:00+00:00",
                                            "shift_end_datetime": "2024-01-31T03:00:00+00:00"}

products = [
    {
        "УникальныйКодПродукта": "12gRV60MMsn1",
        "НомерПартии": 22222,
        "ДатаПартии": "2024-01-30"
    },
    {
        "УникальныйКодПродукта": "12gRV60MMsn2",
        "НомерПартии": 33333,
        "ДатаПартии": "2024-01-31"
    },
    {
        "УникальныйКодПродукта": "12gRV60MMsn3",
        "НомерПартии": 44444,
        "ДатаПартии": "2024-01-29"
    },
    {
        "УникальныйКодПродукта": "12gRV60MMsn4",
        "НомерПартии": 55555,
        "ДатаПартии": "2024-01-28"
    }
]
